Revit 2015 API
IFCTypeInfo Properties
The IFCTypeInfo type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 The material id associated with this type.
ScaledArea
 The area of the type's cross-section, scaled into the units of export.
ScaledDepth
 The depth of the type, scaled into the units of export.
ScaledInnerPerimeter
 The inner perimeter of the boundaries of the type's cross-section, scaled into the units of export.
ScaledOuterPerimeter
 The outer perimeter of the boundaries of the type's cross-section, scaled into the units of export.
See Also
IFCTypeInfo Class
Autodesk.Revit.DB.IFC Namespace